app/views/articles/show.html.erb

SELECT "supports".* FROM "supports"  WHERE "supports"."article_id" = ?  [["article_id", 3]]
SELECT COUNT(*) FROM "supports"  WHERE "supports"."article_id" = ?  [["article_id", 3]]
---
<%#= button_to "Yes: #{@article.supports.count}", {:controller => "articles", :action => "add_support"} %>
<%= button_to "Yes: #{@article.supports.count}", article_supports_path(@article, @user) %>