app/controllers/supports_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 0]]
SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = ? LIMIT 1  [["id", 3]]
INSERT INTO "supports" ("article_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["article_id", 3], ["created_at", "2015-02-15 08:58:29.171436"], ["updated_at", "2015-02-15 08:58:29.171436"]]
---
  def create
    @user = User.find(params[:user_id])
    @article = Article.find(params[:article_id])
    @support = @user.supports.create(support_params)