app/controllers/users_controller.rb

INSERT INTO "users" ("name", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "abc"], ["password", "abc"], ["created_at", "2015-01-21 07:12:40.740137"], ["updated_at", "2015-01-21 07:12:40.740137"]]
---
	def create
		@user = User.new(user_params)
		@h = '0.0'

		if @user.save

SELECT  "users".* FROM "users" WHERE "users"."name" = ? LIMIT 1  [["name", "abc"]]
---
	def login
 		unless request.get?
       	 	@hint = "ok"
        	@user = User.find_by_name(params[:user][:name])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 3]]
---
	def show
    @hint_show = @h
		@users = User.find(params[:id])